//***********************************************************************
//*                                                                     *
//*   Copyright (c) 1985-2019, American Megatrends International LLC.   *
//*                                                                     *
//*      All rights reserved. Subject to AMI licensing agreement.       *
//*                                                                     *
//***********************************************************************
/=#
#langdef en-US "English"

#string STR_PRIORITY_CHANGE_ENTRY           #language en-US "Attempt Priority"
#string STR_ORDER_ATTEMPT_ENTRY_HELP        #language en-US "Change the order of Attempts using +/- keys. Use arrow keys to select the attempt then press +/- to move the attempt up/down in the attempt order list."
#string STR_PRIORITY_CHANGE_ENTRY_HELP      #language en-US "Change the priority using +/- keys. Use arrow keys to select the attempt then press +/- to move the attempt up/down in the attempt order list."
#string STR_DEFAULT_LOCAL_IP                #language en-US "0.0.0.0"         // Default value for Initiator IP
#string STR_DEFAULT_SUBNET_MASK             #language en-US "0.0.0.0"         // Default value for subnet mask
#string STR_DEFAULT_GATEWAY                 #language en-US "0.0.0.0"         // Default value for Gateway
#string STR_DEFAULT_TARGET_IP               #language en-US "0.0.0.0"         // Default value for Target IP
#string STR_DEFAULT_BOOT_LUN                #language en-US "0"               // Default value for Boot LUN
#string STR_ISCSI_TARGET_NAME_HELP          #language en-US "The worldwide unique name of the target. Only iqn. format is accepted. Range is from 4 to 223"
#string STR_CHAP_SECRET_STATUS              #language en-US "    CHAP Status"
#string STR_ISCSI_CHAP_STATUS               #language en-US "" //dynamically updated
#string STR_ISCSI_REVERSE_CHAP_STATUS       #language en-US "" //dynamically updated
#string STR_REVERSE_CHAP_SECRET_STATUS      #language en-US "    Reverse CHAP Status"
#string STR_ISCSI_OUI_FROMAT_ISID           #language en-US "OUI-format ISID"
#string STR_ISCSI_OUI_FROMAT_ISID_VALUE     #language en-US "" //dynamically updated
#string STR_ISCSI_OUI_FROMAT_ISID_HELP      #language en-US "OUI-format ISID in 6 bytes, default value are derived from MAC address. Only last 3 bytes are configurable. These values are taken from "Configure ISID" control."
#string STR_ISCSI_CONFIG_ISID               #language en-US "Configure ISID"
#string STR_EMPTY                           #language en-US ""
#string STR_MAC_STRING_NOT_FOUND            #language en-US "Necessary network protocols are not available to retrieve MAC address. Please try enabling Network Stack."
#string STR_ISCSI_CONFIG_ISID_HELP          #language en-US "OUI-format ISID in 6 bytes, default value are derived from MAC address. Only last 3 bytes are configurable. Example: update 0ABBCCDDEEFF to 0ABBCCF07901 by input F07901."
#string STR_INVALID_ISID                    #language  en-US "Error! Input is incorrect, please input 6 hex numbers!\n"
#string STR_INVALID_CONNECT_MIN_TIMEOUT     #language  en-US "Connection Establishing Timeout is less than minimum value 100ms."
#string STR_GATEWAY_SET_SUBNETMASK_ZERO     #language  en-US "Gateway address is set but subnet mask is zero." 
#string STR_IP_GATEWAY_IN_DIFF_SUBNET       #language  en-US "Local IP and Gateway are not in the same subnet."
#string STR_INVALID_TARGET_IP               #language  en-US "Target IP is invalid!"
#string STR_INVALID_CHAP_NAME               #language  en-US "CHAP Name or CHAP Secret is invalid!"
#string STR_INVALID_REVERSE_CHAP_NAME       #language  en-US "Reverse CHAP Name or Reverse CHAP Secret is invalid!"
#string STR_ATTEMPTS_SAME_NIC               #language  en-US "Warning! Attempt \"%s\" uses same NIC as Attempt \"%s\"."
#string STR_PFA_MODE_IPVER                  #language  en-US "MAC: %s, PFA: Bus %d | Dev %d | Func %d, iSCSI mode: %s, IP version: %s"
#string STR_MAC                             #language  en-US "MAC %s"
#string STR_PFA                             #language  en-US "PFA: Bus %d | Dev %d | Func %d"
#string STR_ATTEMPT                         #language  en-US "%s"
#string STR_MAC_INFO                        #language  en-US "MAC: %s, PFA: Bus %d | Dev %d | Func %d"
#string STR_OFFSET_WIDTH                    #language  en-US "%s&OFFSET=0&WIDTH=%016LX"
#string STR_INVALID_ISCSI_NAME              #language  en-US "Invalid iSCSI Name!!"
#string STR_INVALID_IP_ADDRESS              #language  en-US "Invalid IP address!"
#string STR_INVALID_SUBNETMASK              #language  en-US "Invalid Subnet Mask!"
#string STR_INVALID_GATEWAY                 #language  en-US "Invalid Gateway!"
#string STR_INVALID_LUN                     #language  en-US "Invalid LUN string!"
#string STR_INVALID_TARGETNAME              #language  en-US "iSCSI target name is NULL!"
#string STR_ISCSI_NIC_INDEX                 #language  en-US "iSCSI (%s, NicIndex=%d)"
#string STR_CHAP_STATUS_INSTALLED           #language  en-US "[Installed]"
#string STR_CHAP_STATUS_NOT_INSTALLED       #language  en-US "[Not Installed]"
#string STR_INVALID_TARGET_URL              #language  en-US "iSCSI target Url should not be NULL!"
#string STR_MSGBOX_TITLE                    #language  en-US "iSCSI Message"
#string STR_HOST_ATTEMPT                    #language  en-US "Host Attempt"
#string STR_REDFISH_ATTEMPT                 #language  en-US "Redfish Attempt"
#string STR_RSD_ATTEMPT                     #language  en-US "Rsd Attempt"
#string STR_NO_INITIATOR_NAME               #language  en-US "Error: please configure iSCSI initiator name first!"
#string STR__ISCSI_FORM_TITLE               #language en-US "Host iSCSI Configuration"
#string STR_ISCSI_DHCP_IP_CONFIG            #language en-US "DHCP"
#string STR_ISCSI_STATIC_IP_CONFIG          #language en-US "Static"

